app/Http/Controllers/AffilatesController.php

    public function get()
    {
        $affilates = Affilates::first();
---
select * from `affilates` limit 1