app/Http/Controllers/AppointmentsettingController.php

    public function index()
    {
        $appointmentsettinglist = Appointmentsetting::orderBy('created_at', 'desc')->get();
---
select * from `appointmentsettings` order by `created_at` desc