app/Http/Controllers/AppointmentController.php

select * from `users` where `users`.`deleted_at` is null
select * from `services` where `services`.`deleted_at` is null
select * from `appointments` where `appointments`.`id` = '10' and `appointments`.`deleted_at` is null limit 1
---
    public function edit($id)
    {
        $users = User::all();
        $service = Service::all();
        $appointment = Appointment::findOrFail(strip_tags($id));