app/Http/Controllers/BlogController.php

select * from `blog_categories` where `blog_categories`.`deleted_at` is null
select * from `blogs` where `blogs`.`deleted_at` is null limit 3 offset 0
select count(*) as aggregate from `blogs` where `blogs`.`deleted_at` is null
---
    public function index(Request $request)
    {
        if (!$request->search) {
            $blogCategory = BlogCategory::all();
            $blogs = Blog::paginate(3);

select * from `users` where `users`.`deleted_at` is null
select `title`, `id` from `blog_categories` where `is_active` = '1' and `blog_categories`.`deleted_at` is null
---
    public function create()
    {
        if (!Auth::user()->can('blogs.add')) {

            return abort(403, __('User does not have the right permissions.'));
        }
        $users = User::all();
        $blogcategory = BlogCategory::where('is_active', '1')->pluck('title', 'id')->all();

select `title`, `id` from `blog_categories` where `is_active` = '1' and `blog_categories`.`deleted_at` is null
select * from `users` where `users`.`deleted_at` is null
---
    public function edit(Blog $blog)
    {
        if (!Auth::user()->can('blogs.edit')) {
            return abort(403, __('User does not have the right permissions.'));
        }
        $blogcategory = BlogCategory::where('is_active', '1')->pluck('title', 'id')->all();
        $users = User::all();