app/Http/Controllers/BlogCategoryController.php

    public function index()
    {

        $blogcategory = BlogCategory::orderBy('created_at', 'desc')->get();
---
select * from `blog_categories` where `blog_categories`.`deleted_at` is null order by `created_at` desc