app/Http/Controllers/DietidController.php

select * from `dietids` where `dietids`.`deleted_at` is null
---
    public function create()
    {

        if (!Auth::user()->can('diet_session.add')) {
            return abort(403, __('User does not have the right permissions.'));
        }
        $dietid = Dietid::all();