app/Http/Controllers/DietContentController.php

select * from `dietcontents` where `dietcontents`.`deleted_at` is null
---
    public function create()
    {
        if (!Auth::user()->can('diet_content.add')) {
            return abort(403, __('User does not have the right permissions.'));
        }
        $dietcontent = Dietcontent::all();