app/Http/Controllers/DietController.php

    public function create(Request $request)
    {

        if (!Auth::user()->can('diet.add')) {
            return abort(403, __('User does not have the right permissions.'));
        }
        $input = array_filter($request->all());
        $diet = Diet::get();
        $days = Day::all();
        $dietid = Dietid::all();
---
select * from `diets` where `diets`.`deleted_at` is null
select * from `days`
select * from `dietids` where `dietids`.`deleted_at` is null

    public function update(Request $request, $id)
    {
        if (!Auth::user()->can('diet.edit')) {
            return abort(403, __('User does not have the right permissions.'));
        }
        $this->validate($request, [

            'dietname' => 'required',
            'description' => 'required|max:6000',
            'day_id' => 'required|not_in:0',
            'session_id' => 'required',

        ]);
        $diet = Diet::find(strip_tags($id));
---
select * from `diets` where `diets`.`id` = '179' and `diets`.`deleted_at` is null limit 1

            }
        }

        $diet->update($input);
---
update `diets` set `image` = '16709045464.jpg', `diets`.`updated_at` = '2022-12-13 04:09:06' where `id` = 179