app/Http/Controllers/EnquiryController.php

    public function index(Request $request)
    {

        $occupations = Occupation::all();
        $enq = Enquiry::query();
        $enquiryhealth = Enquiryhealth::all();
---
select * from `occupations` where `occupations`.`deleted_at` is null
select * from `enquiryhealths` where `enquiryhealths`.`deleted_at` is null

    public function create()
    {
        if (!Auth::user()->can('enquiry.add')) {

            return abort(403, __('User does not have the right permissions.'));
        }
        $costs = Cost::all();
        $religions = Religion::all();
        $occupations = Occupation::all();
        $countries = Country::all();
        $secondlanguages = Secondlanguage::all();
        $enquiryhealth = Enquiryhealth::all();
        $enquiry = Enquiry::all();
---
select * from `costs` where `costs`.`deleted_at` is null
select * from `religions` where `religions`.`deleted_at` is null
select * from `occupations` where `occupations`.`deleted_at` is null
select * from `countries`
select * from `secondlanguages` where `secondlanguages`.`deleted_at` is null
select * from `enquiryhealths` where `enquiryhealths`.`deleted_at` is null
select * from `enquiries` where `enquiries`.`deleted_at` is null

    public function destroy($id)
    {
        if (!Auth::user()->can('enquiry.delete')) {
            return abort(403, __('User does not have the right permissions.'));
        }
        $enquiry = Enquiry::findOrFail(strip_tags($id));
        $enquiry->delete();
---
select * from `enquiries` where `enquiries`.`id` = '29' and `enquiries`.`deleted_at` is null limit 1
update `enquiries` set `deleted_at` = '2022-12-21 07:52:57', `enquiries`.`updated_at` = '2022-12-21 07:52:57' where `id` = 29