app/Http/Controllers/ExerciseController.php

select * from `users` where `users`.`deleted_at` is null
select * from `days`
select * from `dietids` where `dietids`.`deleted_at` is null
select * from `exercisenames` where `exercisenames`.`deleted_at` is null
---
    public function create(Request $request)
    {

        if (!Auth::user()->can('exercise.add')) {
            return abort(403,__( 'User does not have the right permissions.'));
        }

        $users = User::all();
        $days = Day::all();
        $sessions = Dietid::all();

        $dietid = Dietid::all();

        $exercisenames = Exercisename::all();

select * from `users` where `users`.`deleted_at` is null
select * from `dietids` where `dietids`.`deleted_at` is null
select * from `days`
select * from `exercisenames` where `exercisenames`.`deleted_at` is null
select * from `exercises` where `exercises`.`id` = '1' and `exercises`.`deleted_at` is null limit 1
---
    public function edit($id)
    {
        if (!Auth::user()->can('exercise.edit')) {
            return abort(403, __('User does not have the right permissions.'));
        }
        $users = User::all();
        $sessions = Dietid::all();
        $days = Day::all();
        $exercisename = Exercisename::all();
        $exercise = Exercise::findOrFail(strip_tags($id));

select * from `exercises` where `exercises`.`id` = '2' and `exercises`.`deleted_at` is null limit 1
---
    public function update(Request $request, $id)
    {
        if (!Auth::user()->can('exercise.edit')) {
            return abort(403,__( 'User does not have the right permissions.'));
        }

        $exercise = Exercise::findOrFail(strip_tags($id));

update `exercises` set `exercisename` = '[\"20\"]', `detail` = '<span style=\"color: rgb(32, 33, 36); font-family: arial, sans-serif;\">Weight gain occurs when more energy (as calories from food and beverage consumption) is gained than the energy expended by life activities, including normal physiological processes and physical exercise.</span>', `time` = '60', `url` = 'http://localhost/GYM/gym_new/public', `followup_date` = '2022-12-12', `exercises`.`updated_at` = '2022-12-12 11:10:26' where `id` = 2
---
        $input['exercisename'] = $request->exercisename_id;
        $input['day'] = $request->day_id;

        $exercise->update($input);