app/Http/Controllers/FeesController.php

    public function index()
    {
        $feeslist = Fees::orderBy('id', 'DESC')->get();
---
select * from `fees` where `fees`.`deleted_at` is null order by `id` desc

    public function edit($id)
    {
        if (!Auth::user()->can('fees.edit')) {
            return abort(403, 'User does not have the right permissions.');
        }
        {
            $fees = Fees::findOrFail(strip_tags($id));
---
select * from `fees` where `fees`.`id` = '2' and `fees`.`deleted_at` is null limit 1