app/Http/Controllers/FrontController.php

    public function blog_details($id)
    {
        $blog = Blog::where('id',$id)->first();
        $data['blog'] = $blog;
        $data['relevant_blogs'] = Blog::where('blog_cat_id',$blog?$blog->blog_cat_id:'')->where('id', '!=' , $id)->get();
---
select * from `blogs` where `id` = '4' and `blogs`.`deleted_at` is null limit 1
select * from `blogs` where `blog_cat_id` = 5 and `id` != '4' and `blogs`.`deleted_at` is null

    public function privacy_policy()
    {
        $data['page'] = PrivacyPolicy::first();
---
select * from `privacy_policies` limit 1