app/Http/Controllers/LanguageController.php

select * from `languages` order by `created_at` desc
---
    public function index()
    {
        $languages = Language::orderBy('created_at', 'desc')->get();