app/Http/Controllers/MeasurementController.php

    public function index(Request $request)
    {
        $measurement = Measurement::orderBy('created_at' , 'desc')->where('user_id','=',Auth::user()->id)->get();
---
select * from `measurements` where `user_id` = 4 and `measurements`.`deleted_at` is null order by `created_at` desc

    public function create(Request $request)
    {
        if(!Auth::user()->can('measurements.add')){
            return abort(403,__('User does not have the right permissions.'));
        }
        $users =User::all();
        $input = array_filter($request->all());
        $trainers =Trainer::all();
        $measurement = Measurement::orderBy('created_at' , 'desc')->where('user_id','=',Auth::user()->id)->get();
---
select * from `users` where `users`.`deleted_at` is null
select * from `trainers` where `trainers`.`deleted_at` is null
select * from `measurements` where `user_id` = 4 and `measurements`.`deleted_at` is null order by `created_at` desc

    public function edit($id)
    {
        if(!Auth::user()->can('measurements.edit')){
            return abort(403,__('User does not have the right permissions.'));
        }
        $users =User::all();
        $trainers =Trainer::all();
        $measurement = Measurement::find(strip_tags($id));
---
select * from `users` where `users`.`deleted_at` is null
select * from `trainers` where `trainers`.`deleted_at` is null
select * from `measurements` where `measurements`.`id` = '42' and `measurements`.`deleted_at` is null limit 1