app/Http/Controllers/MemberattendanceController.php

    public function index()
    {
        $memberattendance = Memberattendance::orderBy('created_at', 'desc')->get();
---
select * from `memberattendances` where `memberattendances`.`deleted_at` is null order by `created_at` desc