app/Http/Controllers/PagesController.php

    public function index()
    {
        $pagelist = Pages::orderBy('created_at', 'desc')->get();
---
select * from `pages` where `pages`.`deleted_at` is null order by `created_at` desc