app/Http/Controllers/QuotationController.php

    public function create()
    {
        $countries = Country::all();
---
select * from `countries`

    public function show($id)
    {
        $quotation = Quotation::find(strip_tags($id));
        $subquotation = Subquotation::where('quotation_id',strip_tags($id))->get();
        $invoice = Invoice::find(strip_tags($id));
---
select * from `quotations` where `quotations`.`id` = '4' and `quotations`.`deleted_at` is null limit 1
select * from `subquotations` where `quotation_id` = '4' and `subquotations`.`deleted_at` is null
select * from `invoices` where `invoices`.`id` = '4' limit 1