app/Http/Controllers/ReligionController.php

insert into `religions` (`religion`, `is_active`, `updated_at`, `created_at`) values ('Test', 1, '2022-12-21 18:04:59', '2022-12-21 18:04:59')
---
    public function store(Request $request)
    {
        $request->validate([
            'religion' => 'required',
        ]);

        $input = array_filter($request->all());
        $religion = new Religion;
        $input['is_active'] = isset($input['is_active']) ? 1 : 0;
        $religion = Religion::create($input);