app/Http/Controllers/SettingController.php

select * from `site_settings` limit 1
select * from `currencies` where `id` = '8' and `currencies`.`deleted_at` is null
---
    public function get()
    {
		$setting = Settings::first();
        $currency = Currency::where('id', $setting->default_currency)->get();