app/Http/Controllers/SliderController.php

    public function edit($id)
    {
        $slider = Slider::findOrFail(strip_tags($id));
---
select * from `sliders` where `sliders`.`id` = '8' and `sliders`.`deleted_at` is null limit 1