app/Http/Controllers/StaffattendanceController.php

    public function edit($id)
    {
        if (!Auth::user()->can('staff_attendance.edit')) {
            return abort(403, __('User does not have the right permissions.'));
        }
        $users = User::all();
        $staffattendance = Staffattendance::find($id);
---
select * from `users` where `users`.`deleted_at` is null
select * from `staffattendances` where `staffattendances`.`id` = '3' and `staffattendances`.`deleted_at` is null limit 1