app/Http/Controllers/SupplementController.php

    public function index()
    {
        $supplement = Supplement::orderBy('id', 'DESC')->get();
---
select * from `supplements` where `supplements`.`deleted_at` is null order by `id` desc

    public function create()
    {
        if (!Auth::user()->can('supplement.add')) {
            return abort(403,__( 'User does not have the right permissions.'));
        }
        $supplement = Supplement::all();
---
select * from `supplements` where `supplements`.`deleted_at` is null

    public function store(Request $request)
    {
        if (!Auth::user()->can('supplement.add')) {
            return abort(403, __('User does not have the right permissions.'));
        }
        $request->validate([
            'name' => 'required',
            'link' => 'required|regex:#^https?://#',
            'detail' => 'required|string|max:5000',
            'price' => 'required|string|numeric:supplement',
        ]);
        $input['is_active'] = strip_tags($request->is_active);
        if (!isset($input['is_active'])) {
            $input = array_filter($request->all());
        }

        if ($file = $request->file('image')) {
            $optimizeImage = Image::make($file);
            $optimizePath = public_path() . '/image/supplements/';
            $name = time() . $file->getClientOriginalName();
            $optimizeImage->save($optimizePath . $name, 72);
            $input['image'] = $name;
        }
        $input['name'] = strip_tags($request->name);
        $input['link'] = strip_tags($request->link);
        $input['detail'] = strip_tags($request->detail);
        $input['price'] = strip_tags($request->price);
        $input['offerprice'] = strip_tags($request->offerprice);
        $supplement = Supplement::create($input);
---
insert into `supplements` (`is_active`, `image`, `name`, `link`, `detail`, `price`, `offerprice`) values ('1', '1670871474images.jpeg', 'Optimum Nutrition', 'http://localhost/GYM/gym_new/public', 'Optimum Nutrition ON Micronized Creatine Powder, Supports Athletic Performance &amp; Power, 83 serves Creatine&nbsp;&nbsp;(250 g, Unflavored)', '887', '700')

    public function update(Request $request, $id)
    {
        if (!Auth::user()->can('supplement.edit')) {
            return abort(403, __('User does not have the right permissions.'));
        }

        $request->validate([
            'name' => 'required',
            'link' => 'required|regex:#^https?://#',
            'detail' => 'required|string|max:5000',
            'price' => 'required|string|numeric:supplement',

        ]);
        $supplement = Supplement::findOrFail($id);
---
select * from `supplements` where `supplements`.`id` = '5' and `supplements`.`deleted_at` is null limit 1

            $optimizeImage->save($optimizePath . $name, 70);
            $input['image'] = $name;
        }
        $supplement->update($input);
---
update `supplements` set `image` = '1670870912download (1).jpeg', `detail` = '<p><span style=\"color: rgb(33, 33, 33); font-family: Roboto, Arial, sans-serif; font-size: 18px;\">BON ISO WHEY 100% Protein Isolate for Muscle Strength and Bone Health Whey Protein</span><span style=\"color: rgb(33, 33, 33); font-family: Roboto, Arial, sans-serif; font-size: 18px;\">  (1 kg, Irish Chocolate)</span><br></p>' where `id` = 5