app/Http/Controllers/TodoController.php

    public function index()
    {

        $auth = Auth::user();

        $users = User::where('role_type', '!=', 'Super Admin')->pluck('name', 'id');

        $boards = TodoBoard::where('created_by', $auth->id)->orWhere('assigned_to', $auth->id)->orWhere('is_public', '1')->get();
---
select `name`, `id` from `users` where `role_type` != 'Super Admin' and `users`.`deleted_at` is null
select * from `todo_boards` where `created_by` = 4 or `assigned_to` = 4 or `is_public` = '1'