app/Http/Controllers/TrainerlistController.php

select * from `trainerlists` where `trainerlists`.`deleted_at` is null
---
    public function index(Request $request)
    {
        $trainerlist = Trainerlist::all();