app/Http/Controllers/TrainerController.php

    public function index(Request $request)
    {
        if (!$request->search) {
            $trainers = Trainer::paginate(2);
---
select * from `trainers` where `trainers`.`deleted_at` is null limit 2 offset 0
select count(*) as aggregate from `trainers` where `trainers`.`deleted_at` is null

    public function create()
    {
        if (!Auth::user()->can('trainer.add')) {
            return abort(403, __( 'User does not have the right permissions.'));
        }
        $users = User::whereHas(
            'roles', function ($q) {
                $q->where('name', 'Trainer');
            })->get();
        $countries = Country::all();
        $trainer = Trainer::all();
---
select * from `countries`
select * from `trainers` where `trainers`.`deleted_at` is null

    public function edit($id)
    {
        if (!Auth::user()->can('trainer.edit')) {
            return abort(403,__( 'User does not have the right permissions.'));
        }
        $countries = Country::all();
        $state = State::all();
        $users = User::whereHas(
            'roles', function ($q) {
                $q->where('name', 'Trainer');
            })->get();

        $trainer = Trainer::find(strip_tags($id));
        $user_info = User::find(4);
---
select * from `countries`
select * from `states`
select * from `trainers` where `trainers`.`id` = '45' and `trainers`.`deleted_at` is null limit 1
select * from `users` where `users`.`id` = 4 and `users`.`deleted_at` is null limit 1