app/Http/Controllers/TypeController.php

select * from `types` where `types`.`deleted_at` is null order by `created_at` desc
---
    public function index()
    {
        $typelist = Type::orderBy('created_at', 'desc')->get();

insert into `types` (`name`, `is_active`, `updated_at`, `created_at`) values ('Lunges', '1', '2022-12-12 11:04:37', '2022-12-12 11:04:37')
---
    public function store(Request $request)
    {
        $request->validate([
            'name' => 'required|string|',
        ]);
        $input = array_filter($request->all());
         if (!isset($input['is_active'])) {
            $input['is_active'] = 0;
        }
        $type = Type::create($input);

select * from `types` where `types`.`id` = '8' and `types`.`deleted_at` is null limit 1
---
    public function edit($id)
    {
        {
            $type = Type::findOrFail($id);