app/Http/Controllers/UsersController.php

select * from `roles`
select * from `users` where `users`.`deleted_at` is null limit 6 offset 0
select count(*) as aggregate from `users` where `users`.`deleted_at` is null
select * from `users` where `demo` = 'yes' and `users`.`deleted_at` is null
select * from `users` where `membership` = 'yes' and `users`.`deleted_at` is null
---
    public function index(Request $request)
    {
        $roles = Role::all();
        if (!$request->get('search')) {
            $userquery = User::query();
            $user = auth()->user();
            if ($user->hasRole('Super Admin')) {
                $users = $userquery->paginate(6);
            } elseif ($user->hasRole('Trainer')) {
                $trainer = Auth::user();
                $users = $userquery->paginate(6);
            } else {
                $users = $userquery->where('id', auth()->id())->paginate(6);
            }
        } else {
            $users = User::where('name', 'LIKE', '%' . strip_tags($request->search) . '%')->orWhere('email', 'LIKE', '%' . strip_tags($request->search) . '%')->paginate(6);
        }
        if ($request->roles != null) {
            if ($request->roles == 'all' || $request->roles == 'All') {
                $users = User::paginate(6);
            } else {
                $users = User::whereHas(
                    'roles', function ($q) use ($request) {
                        $q->where('name', strip_tags($request->roles));
                    }
                )->paginate(6);
            }

        }
        $demo = User::where('demo', '=', 'yes')->get();
        $vip = User::where('membership', '=', 'yes')->get();

select * from `roles`
select * from `users` where `uuid` = '97f9e2a4-6850-4896-8c0e-5a39fbb6e4e4' and `users`.`deleted_at` is null limit 1
select * from `countries`
---
    public function edit($id)
    {
        if (!Auth::user()->can('users.edit')) {
            return abort(403, (__('User does not have the right permissions.')));
        }
        $roles = Role::all();
        $user = User::where('uuid', $id)->first();
        $countries = Country::all();