app/Providers/AppServiceProvider.php

    public function boot()
    {
         view()->composer('*',function($view){

          if(\DB::connection()->getDatabaseName()){

                $setting = Settings::first();
---
select * from `site_settings` limit 1